[
  {
    "title": "Basics",
    "desc": "This custom rule set is based on DnD 5th Edition with some alterations. The alterations are based around theming, simplicity, and slightly less randomness.",
    "sections": [
      {
        "title": "Dice",
        "desc": "Dice are a large part of DnD, introducing an element of randomness and excitement. The dice used will be standard DnD dice: d4, d6, d8, d10, d12, d20, d100."
      },
      {
        "title": "Rounding",
        "desc": "When calculating a result that ends up not being a whole number, you should always <b>round down</b>."
      },
      {
        "title": "Checks",
        "desc": "When performing an arbitrary action, the character may be asked to perform a check. A check tests a character’s innate talent and training in an effort to overcome a challenge. The GM calls for an ability check when a character attempts an action (other than an attack) that has a chance of failure. When the outcome is uncertain, the dice determine the results. For every ability check, the GM decides which of the six stats is relevant to the task at hand and the difficulty of the task, represented by a Difficulty Class. You will be informed of the general difficulty of the task before attempting to do it. The more difficult a task, the higher its DC:",
        "sections": [
          {
            "desc": "<table><tr class='header'><td><b>Difficulty</b></td><td><b>DC</b></td></tr><tr><td>Trivial</td><td>5</td></tr><tr><td>Easy</td><td>10</td></tr><tr><td>Medium</td><td>20</td></tr><tr><td>Hard</td><td>30</td></tr><tr><td>Very hard</td><td>40</td></tr><tr><td>Nearly impossible</td><td>50+</td></tr></table>"
          },
          {
            "desc": "To make an ability check, roll a d20 and add the relevant ability modifier. As with other d20 rolls, apply bonuses and penalties, and compare the total to the DC. If the total equals or exceeds the DC, the ability check is a success—the creature overcomes the challenge at hand. Otherwise, it’s a failure, which means the character or monster makes no progress toward the objective or makes progress combined with a setback determined by the GM. Some checks may require teamwork (for example pushing a very large object), in this case, players can roll together to combine into a stronger check."
          },
          {
            "desc": "Certain actions will be tied to a single stat, examples are as follows:"
          },
          {
            "title": "Strength",
            "desc": "Athletics, Forcing, Grappling"
          },
          {
            "title": "Agility",
            "desc": "Acrobatics, Thievery, Stealth"
          },
          {
            "title": "Intelligence",
            "desc": "Knowledge, Investigation"
          },
          {
            "title": "Spirit",
            "desc": "Medicine, Perception, Survival"
          },
          {
            "title": "Charisma",
            "desc": "Deception, Intimidation, Persuasion"
          }
        ]
      }
    ]
  },
  {
    "title": "Resting",
    "desc": "Characters can rest out of combat to gain health and refresh certain abilities. There are two types of rests:",
    "sections": [
      {
        "title": "Short Rest",
        "desc": "A short rest is considered a 1 hour break that the characters can use after combat to recover health. Shorts rests should only be taken when the characters are not currently in any immediate danger.",
        "sections": [
          {
            "desc": "If the characters have food and water while taking a short rest, they can spend a number of hit dice to regain health. For each hit dice, they roll it and add their <b>constitution</b>. For example a level 3 warrior (class hid die 1d12) with 4 CON:"
          },
          {
            "desc": "Characters can regain spent hit dice by taking a long rest as below."
          }
        ]
      },
      {
        "title": "Long Rest",
        "desc": "A long rest is considered a full nights sleep taking place in a prepared camp or lodgings. Provided the characters have access to food and water, they regain all hit points, refresh all abilities and remove any existing <b>exhausted</b> conditions.",
        "sections": [
          {
            "desc": "When taking a long rest, characters also regain a number of their spent hit dice equal to half their maximum number of hit dice. For example if a level 5 warrior had spent all 5 of his d12 dice, he would regain 2 of those on long rest."
          }
        ]
      }
    ]
  },
  {
    "title": "Combat",
    "desc": "Combat in Solusek is divided up into 4 stages: <b>Suprise</b>, <b>Initiative</b>, <b>Position</b> and <b>Rounds</b>.",
    "sections": [
      {
        "title": "Suprise",
        "desc": "The DM first determines if either the players or their enemies have been caught unawares. If so, the other side will gain one free combat round before rolling initiative."
      },
      {
        "title": "Initiative",
        "desc": "Each character, including NPCs will now roll initiative. This involves rolling 1d20 and adding the character's <b>movement</b> stat. The result will determine turn order, highest going first."
      },
      {
        "title": "Position",
        "desc": "If necessary, distance and position is now determined by the DM, though it may already be evident."
      },
      {
        "title": "Rounds",
        "desc": "Each character, in initiative order, will then begin taking turns. When all characters have taken a turn then the next round starts, beginning again with the highest initiative. Rounds continue until one side surrenders or is defeated. A character, on their turn, may perform a <b>movement</b>, an <b>action</b> and one <b>bonus action</b>. These are all optional and can be performed in any order as long as it is logical.",
        "sections": [
          {
            "title": "Movement",
            "desc": "During their movement, the character may move a number of squares up to their <b>movement</b> stat. Enemy characters block movement, friendly characters do not. While <b>snared</b> or on <b>difficult terrain</b>, movement costs twice as much per square, effectively halving possible movement."
          },
          {
            "title": "Action",
            "desc": "An action consists of: a <b>basic attack</b>, casting a <b>spell</b>, using a <b>skill</b> of type 'action', using a <b>dash</b> or <b>disengage</b>, or performing any other non-combat action which the DM deems to take a significant amount of time.",
            "sections": [
              {
                "title": "Basic Attack",
                "desc": "You can make a regular attack with the weapon in your main hand, see below for more information on attacking."
              },
              {
                "title": "Spell",
                "desc": "Most spells consume your action, unless otherwise stated on the spell or via the character's special skill."
              },
              {
                "title": "Skill",
                "desc": "Skills which are of type 'Action' can be used, many of which will also be classed as an 'Attack'."
              },
              {
                "title": "Dash",
                "desc": "The character can spend their action to move an additional number of spaces up to their movement."
              },
              {
                "title": "Grapple",
                "desc": "Characters can attempt to grapple or hold an enemy, making an attack vs Dodge to initiate the grapple. If successful the character must make a STR saving throw each turn vs a DC of 10 + the grapplers STR or be held in place."
              },
              {
                "title": "Disengage",
                "desc": "The character can spend their action to disengage from a foe in melee range, allowing them to then move without provoking an <b>attack of opportunity</b>."
              }
            ]
          },
          {
            "title": "Bonus Action",
            "desc": "The bonus action covers smaller actions such as: picking up an item, equipping a weapon, making a perception check or any other action which the DM deems to only take a small amount of time."
          },
          {
            "title": "Attacking",
            "desc": "Attacking generally covers any aggressive action which intends to affect another character. This can include a basic attack with a weapon, an attacking spell, or a skill of type 'attack' as well as any other action such as attempting to tackle or throw a character. The steps for an attack are: 'Roll to hit', 'Roll for damage', 'Subtract health",
            "sections": [
              {
                "title": "Roll to Hit",
                "desc": "Firstly the character rolls to hit versus the targets <b>avoidance</b>. This involves rolling 1d20 then adding the relevant stat, for most normal attacks this will be 'Agility', however spells and other actions may use a different stat. The resulting roll is then compared to the enemies 'avoidance', for most normal attacks this will be their 'dodge', if the attack is equal to or higher then it counts as a hit. For example, a level 2 warrior with 4 agility makes a basic attack against a goblin with a dodge of 2:",
                "code": "Roll to hit = (1d20 + 4) vs 12 = (9 + 4) vs 12 = 13 vs 12 = hit!"
              },
              {
                "title": "Roll for Damage",
                "desc": "If the attack was considered a hit, then the attacker will need to roll for damage. The weapon, spell or skill will determine the dice and modifier used. The resulting value is then modified by the targets <b>mitigation</b>, either <b>armour</b> or <b>magic reduction</b> depending on the type of attack. For example as above, the warrior was using his short sword (1d6 + STR), has 4 strength and hit the goblin who has 1 armour:",
                "code": "Roll for damage = 1d6 + 4 = 3 + 4 = 7 - 1 (armour) = 6 damage"
              },
              {
                "title": "Subtract Health",
                "desc": "If there is any damage leftover after <b>mitigation</b>, then that damage is applied directly to the target, subtracting that amount of health (or temporary health if applicable)."
              },
              {
                "title": "Resistance",
                "desc": "If a character has resistance to a particular damage type, all damage they receive of that type is halved. This occurs after <b>Armour</b>/<b>Magic Reduction</b> have been applied.."
              },
              {
                "title": "Critical Hits",
                "desc": "When a character rolls a <i>natural</i> 20, meaning their d20 roll before modifiers was 20, they score a critical hit. Critical hits count as full damage, so damage does not need to be rolled."
              },
              {
                "title": "Range",
                "desc": "All weapons, spells and skill will have a range value. 0 and 1 are considered melee attacks, anything higher is considered a ranged attack. To determine ranged attacks trace a straight line from source to target to see if the range is met; if the distance is less than or equal to the range there is no penalty, however for each additional square, a penalty is added to the attack accuracy. The effect is cumulative, so 1 additional square is a penalty of -1, 2 additional squares is the previous -1 plus an additional -2 (so -3), 3 additional squares is -1 + -2 + -3 (-6) and so on."
              },
              {
                "title": "Attack of Opportunity",
                "desc": "When a character moves out of a square in front of an enemy who was previously in melee range of them, the foe is able to make a free <b>Basic Attack</b> against the moving character. This can avoided by the use of <b>Disengage</b>."
              }
            ]
          },
          {
            "title": "Reaction",
            "desc": "Some skills are considered <b>reactions</b> and these can be used outside of the characters turn provided all other requirements on the skill are met. Each character can only use a <b>Reaction</b> once per round."
          }
        ]
      }
    ]
  },
  {
    "title": "Death",
    "desc": "It <i>will</i> be possible to die. The DM is responsible for making sure any death seems 'fair', however it is your responsibility as players to avoid putting your characters in situations where death is likely. It is possible to recover from death through rare magical equipment or high level <b>Cleric</b> spells, but these will be unavailable for some time.",
    "sections": [
      {
        "title": "Dying",
        "desc": "Whenever you start your turn with 0 health, you must make a special check, called a <b>death saving throw</b>, to determine whether you creep closer to death or hang onto life. Unlike other saving throws, this one isn’t tied to any ability score. You are in the hands of fate now, aided only by spells and features that improve your chances of succeeding on a saving throw.",
        "sections": [
          {
            "desc": "<b>Roll a d20:</b> If the roll is 10 or higher, you succeed. Otherwise, you fail. A success or failure has no effect by itself. On your third success, you become stable (see below). On your <b>third</b> failure, you die. The successes and failures don’t need to be consecutive; keep track of both until you collect three of a kind. The number of both is reset to zero when you regain any hit points or become stable."
          },
          {
            "desc": "<b>Rolling 1 or 20:</b> When you make a death saving throw and roll a 1 on the d20, it counts as two failures. If you roll a 20 on the d20, you regain 1 hit point."
          },
          {
            "desc": "<b>Damage at 0 Hit Points</b>: If you take any damage while you have 0 hit points, you suffer a death saving throw failure. If the damage is from a critical hit, you suffer two failures instead. If the damage equals or exceeds your hit point maximum, you suffer instant death."
          },
          {
            "desc": " A character who is healed above 0 health is considered immediately conscious and no longer dying."
          }
        ]
      },
      {
        "title": "Instant Death",
        "desc": "Instant death can occur when a player takes damage which would reduce them to their maximum health below 0. This can occur on any player regardless of whether they are already dying, for example if a character with 20/20 max health gets hit for 40 damage, they would instantly be dead.",
        "sections": [
          {
            "desc": "For this reason extra care should be taken with characters or creatures that are far more powerful than you. Provoking an attack from them would not be wise!"
          }
        ]
      },
      {
        "title": "Stabilizing",
        "desc": "When a character is stable, they are still considered unconscious and at 0 health, however they are no longer dying. Characters can be stabilised by other players through the use of bandages, and in some cases resourceful role play actions such as putting pressure on blood flow etc."
      }
    ]
  },
  {
    "title": "Character Advancement",
    "desc": "Characters advance in level by earning experience points. These are awarded for various actions such as defeating enemies in combat, completing a quest, or exceptional feats of roleplaying.",
    "sections": [
      {
        "desc": "When advancing in level, characters will unlock skills and spells dependant on their class. Regardless of class, on each level up, characters receive one stat point to spend as they choose. Base stats (before race modifier adjustment) at creation can only be a maximum of 5. During advancement a base stat cannot be raised above 15. It should be noted that stats can be raised above 15 via race and equipment modifiers."
      },
      {
        "desc": "The requirements for each level are as follows:"
      },
      {
        "desc": "<table><tr class='header'><td><b>Character Level</b></td><td><b>Total Experience Required</b></td></tr><tr><td>1</td><td>0</td></tr><tr><td>2</td><td>300</td></tr><tr><td>3</td><td>900</td></tr><tr><td>4</td><td>2700</td></tr><tr><td>5</td><td>6500</td></tr><tr><td>6</td><td>14000</td></tr><tr><td>7</td><td>23000</td></tr><tr><td>8</td><td>34000</td></tr><tr><td>9</td><td>48000</td></tr><tr><td>10</td><td>64000</td></tr><tr><td>11</td><td>85000</td></tr><tr><td>12</td><td>100000</td></tr><tr><td>13</td><td>120000</td></tr><tr><td>14</td><td>140000</td></tr><tr><td>15</td><td>165000</td></tr><tr><td>16</td><td>195000</td></tr><tr><td>17</td><td>225000</td></tr><tr><td>18</td><td>265000</td></tr><tr><td>19</td><td>305000</td></tr><tr><td>20</td><td>355000</td></tr></table>"
      }
    ]
  },
  {
    "title": "Inspiration",
    "desc": "Inspiration is a rule the game master can use to reward you for playing your character in a way that’s true to his or her personality traits, ideal, bond, and flaw. By using inspiration, you can draw on your personality trait of compassion for the downtrodden to give you an edge in negotiating with the Beggar Prince. Or inspiration can let you call on your bond to the defense of your home village to push past the effect of a spell that has been laid on you.",
    "sections": [
      {
        "title": "Gaining Inspiration",
        "desc": "Your GM can choose to give you inspiration for a variety of reasons. Typically, GMs award it when you play out your personality traits, give in to the drawbacks presented by a flaw or bond, and otherwise portray your character in a compelling way. Your GM will tell you how you can earn inspiration in the game."
      },
      {
        "desc": "You either have inspiration or you don’t — you can’t stockpile multiple “inspirations” for later use."
      },
      {
        "title": "Using Inspiration",
        "desc": "If you have inspiration, you can expend it when you make an Attack roll, saving throw, or ability check. Spending your inspiration gives you advantage on that roll."
      },
      {
        "desc": "Additionally, if you have inspiration, you can reward another player for good roleplaying, clever thinking, or simply doing something exciting in the game. When another player character does something that really contributes to the story in a fun and interesting way, you can give up your inspiration to give that character inspiration."
      }
    ]
  },
  {
    "title": "Advantage",
    "desc": "Sometimes a Special ability or spell tells you that you have advantage or disadvantage on an ability check, a saving throw, or an Attack roll. When that happens, you roll a second d20 when you make the roll. Use the higher of the two rolls if you have advantage, and use the lower roll if you have disadvantage. For example, if you have disadvantage and roll a 17 and a 5, you use the 5. If you instead have advantage and roll those numbers, you use the 17.",
    "sections": [
      {
        "desc": "If multiple situations affect a roll and each one grants advantage or imposes disadvantage on it, you don’t roll more than one additional d20. If two favorable situations grant advantage, for example, you still roll only one additional d20."
      },
      {
        "desc": "If circumstances cause a roll to have both advantage and disadvantage, you are considered to have neither of them, and you roll one d20. This is true even if multiple circumstances impose disadvantage and only one grants advantage or vice versa. In such a situation, you have neither advantage nor disadvantage."
      },
      {
        "desc": "You usually gain advantage or disadvantage through the use of skills or <b>inspiration</b>. The GM can also decide that circumstances influence a roll in one direction or the other and grant advantage or impose disadvantage as a result."
      }
    ]
  },
  {
    "title": "Conditions",
    "desc": "There are many conditions throughout the world which have both positive and usually negative effects for a given duration.",
    "sections": [
      {
        "title": "Blinded",
        "desc": "Blinded characters have their movement halved and make any attack rolls with <b>Disadvantage</b>."
      },
      {
        "title": "Charmed",
        "desc": "Charmed characters have had their mind enslaved and must obey the wishes of their master for the duration."
      },
      {
        "title": "Dead",
        "desc": "Characters are dead when they either fail 3 <b>death saving throws</b> or suffer <b>instant death</b>. Dead characters are gone, however there are some magical artifacts and spells which can bring dead characters back to life within a short duration of their death."
      },
      {
        "title": "Dying",
        "desc": "Characters at 0 health which have not yet been <b>stabilized</b> are considered to be dying, and must make a <b>death saving throw</b> each turn. Dying characters are always considered <b>unconscious</b>."
      },
      {
        "title": "Exhausted",
        "desc": "A character who is exhausted can no longer gain the benefits of a <b>short rest</b> and must take a <b>long rest</b> in order to recover from the condition."
      },
      {
        "title": "Feared",
        "desc": "While feared, your character has <b>disadvantage</b> on any attack rolls against the create which caused the fear. At the end of each turn you must make a SPI saving throw, on success you are no longer fe"
      },
      {
        "title": "Hasted",
        "desc": "While hasted, a character's <b>Speed</b> is doubled and they can perform 2 <b>Actions</b> on their turn."
      },
      {
        "title": "Invisible",
        "desc": "Invisible characters cannot be seen or attacked, except by characters with the <b>See Invisible</b> trait."
      },
      {
        "title": "Mad",
        "desc": "Madness can affect characters in many ways ranging from a minor OCD to mistaking teammates for enemies in battle. The type and duration of madness will be defined as and when it occurs."
      },
      {
        "title": "Rooted",
        "desc": "Rooted characters are held in place by some force and cannot move for the duration. They can still perform other actions as normal."
      },
      {
        "title": "Snared",
        "desc": "Snared characters have their movement hindered in some way, and only receive half their usual speed (rounded down)."
      },
      {
        "title": "Grappled",
        "desc": "A character who is grappled is considered <b>rooted</b> and the only action they can make is an attempt to free themselves, making a STR check vs the grapple difficulty."
      },
      {
        "title": "Stabilized",
        "desc": "Characters are considered stabilized if they are at 0 health but are no longer <b>dying</b>. They are still considered <b>unconscious</b>."
      },
      {
        "title": "Stunned",
        "desc": "Stunned characters suffer a -5 modifier to their <b>dodge</b> rating and cannot move or perform any actions on their turn, however they are still aware of their surroundings."
      },
      {
        "title": "Poisoned",
        "desc": "Poisoned characters take the effects of the specific poison at start of their turn, they must then make a CON saving throw against the DC described, if they succeed they are no longer poisoned."
      },
      {
        "title": "Wounded",
        "desc": "Characters are considered wounded when they are at less than 50% of their maximum health. Some abilities will only be in effect when a character or target is wounded."
      },
      {
        "title": "Unconscious",
        "desc": "Characters are considered unconscious when their health is at 0, and they suffer a -5 to their <b>dodge</b> rating. Unconscious characters are unaware of their surroundings and cannot move or take any actions on their turn."
      }
    ]
  },
  {
    "title": "Cantrips",
    "desc": "A cantrip is a spell that can be cast at will, without using a spell slot and without being prepared in advance. Repeated practice has fixed the spell in the caster’s mind and infused the caster with the magic needed to produce the effect over and over.",
    "sections": [
      {
        "desc": "Wizards, Necromancers and Enchanters have access to all cantrips from level 1 onwards."
      },
      {
        "title": "Magic Hand",
        "desc": "Create a magical hand visible only to you which you can control in order to pick up small, light objects. Lasts for up to a minute."
      },
      {
        "title": "Minor Illusion",
        "desc": "Create an illusion of your choice at a target location. It must be an illusion of something familiar to you and only lasts for a few seconds."
      },
      {
        "title": "Spark",
        "desc": "Create a small, distracting spark at a given location within line of sight. It lasts only a second or so. Can be used to start a fire if the conditions are good."
      },
      {
        "title": "Far Sight",
        "desc": "Magically extend your sight, allowing you to see slightly further (as if you were using binoculars) for a few seconds."
      },
      {
        "title": "Warmth",
        "desc": "A soothing warmth emanates from your hands, warming anything you touch for a few minutes."
      }
    ]
  },
  {
    "title": "Tradeskills",
    "desc": "Characters can craft many types of items in the game, each belonging to a certain tradeskill",
    "sections": [
      {
        "desc": "When crafting an item, each character can contribute 5 gold worth of item per tradeskill level per day. For example to create a suite of plate armour worth 300 gold, a group of 4 characters all at level 1 smithing would contribute 20 gold's worth per day, taking 15 days total."
      },
      {
        "desc": "Characters all start at level 1 in each tradeskill, and gain 100 experience per day spent crafting. Experience required per table is the same as the one for <b>character advancement</b>."
      },
      {
        "title": "Alchemy",
        "desc": "For the crafting of potions"
      },
      {
        "title": "Enchantment",
        "desc": "For the enchanting of items to make them magical"
      },
      {
        "title": "Fletching",
        "desc": "For the crafting of arrows and bows"
      },
      {
        "title": "Smithing",
        "desc": "For the crafting of metal based armour and weapons"
      },
      {
        "title": "Tailoring",
        "desc": "For the crafting of clothing"
      },
      {
        "title": "Tanning",
        "desc": "For the crafting of leather armour"
      }
    ]
  }
]
