{
  "1": {
    "title": "Scenario 1 - Marked",
    "events": [
      {
        "type": "Story",
        "desc": "The party awakened in a dungeon under the city of Freeport. They watched helplessly as Kevnan and Holly were slaughtered as a sacrifice."
      },
      {
        "type": "Encounter",
        "desc": "Morden then cast arcane missiles, triggering combat while still shackled to the wall, managing to eventually get free and kill 1 Hollow Necromancer and 2 Hollow Acolytes."
      },
      {
        "type": "Story",
        "desc": "An unknown demon entered the world via a rift and cast a dark spell on the party before being pulled back into the rift. Morden noted 3 Fel symbols by the altar."
      },
      {
        "type": "Story",
        "desc": "The party rescued a small elf girl named Sophea. They took her to Gregory at The Lazy Druid but he had never seen her before. They inspected her house (Kevnan and Holly's), and found some strange symbols on her door as well as journal pages saying she was delivered to them as a baby."
      },
      {
        "type": "Story",
        "desc": "Sophea took an immediate liking to Ruarih, as he seemed quite protective."
      },
      {
        "type": "Story",
        "desc": "Visiting the wizard's circle in Freeport, they met a pompous mage named Articus who didn't believe them. Out of nowhere appeared the old Archmage Belgarath who had been watching them on arrival of the circle."
      },
      {
        "type": "Story",
        "desc": "Belgarath revealed the mark of the demon on their chests and explained it was the demon's name. Morden noted it was also the same as one of the symbols from the altar in the dungeon, and learned the other symbols were used to 'call' him."
      },
      {
        "type": "Story",
        "desc": "Belgarath warned the party that the mark would erode their mind and enslave them. There was no known cure but he told them to seek The Enchantress as soon as possible and ask her to help shield against the effects."
      },
      {
        "type": "Story",
        "desc": "Sophea asked to stay with the party, as she felt safe with them and had lost everyone else she knew."
      }
    ]
  },
  "2": {
    "title": "Scenario 2 - Enchanted",
    "events": [
      {
        "type": "Travel",
        "desc": "The party were teleported to an unknown location by Belgarath."
      },
      {
        "type": "Story",
        "desc": "The party ventured into the home of the enchantress passing many illusions on the way."
      },
      {
        "type": "Encounter",
        "desc": "A set of mirror images attacked the party after Fen threw a shoe at the mirror. Sophea managed to dispel her illusion without force."
      },
      {
        "type": "Story",
        "desc": "The party met the 'giant' Yiana, who agreed to help them in return for their help retrieving a stolen amulet."
      },
      {
        "type": "Travel",
        "desc": "The party travelled west to the goblin camp."
      },
      {
        "type": "Story",
        "desc": "Resting on the way, the party experienced a nightmare: Visions of consuming fallen enemies in a barren landscape, followed by a giant demon morphing into Sophea, giggling, and stabbing them in the stomach."
      },
      {
        "type": "Encounter",
        "desc": "The party entered the Goblin camp and defeated 2 Wolves, 3 goblin archers, 1 goblin shaman and 1 bugbear."
      },
      {
        "type": "Story",
        "desc": "Upon opening a locked room at the back of the goblin den, the party found the goblin leader Grubby wearing the amulet. He offered it to them but Skalath slit his throat anyway."
      },
      {
        "type": "Travel",
        "desc": "The party returned east to the home of the enchantress Yiana."
      },
      {
        "type": "Story",
        "desc": "Resting on the way, the party experienced another nightmare: More visions of consuming fallen enemies in a barren landscape followed by a giant demon morphing into Sophea and retreating, giggling, into the darkness."
      },
      {
        "type": "Story",
        "desc": "After returning the amulet to Yiana, she cast a mind protection spell on them and revealed that Sophea was a Fey. Yiana also revealed her own true image as a halfling."
      },
      {
        "type": "Travel",
        "desc": "Leaving the Enchantress's home, the party find Belgarath waiting down the path smoking a pipe, who teleports them back to Freeport."
      },
      {
        "type": "Story",
        "desc": "Belgarath offers to cast a spell of revelation to attempt to discover where Sophea came from, and leaves to prepare at her house."
      },
      {
        "type": "Shopping",
        "desc": "At the local blacksmith, Fen manages to connect with the proprietor Varden over ties to Sherridon and negotiates a discount."
      },
      {
        "type": "Shopping",
        "desc": "At a nearby tannery, Skalath manages to intensely offend and anger the owner, Sharna."
      }
    ]
  },
  "3": {
    "title": "Scenario 3 - Revelation",
    "events": [
      {
        "type": "Story",
        "desc": "Belgarath casts his spell of revelation. The party witnesses the events of Sophea's mother bringing the baby Sophea through a rift and giving her to Kevnan and Holly."
      },
      {
        "type": "Story",
        "desc": "A robed man floats in and after a struggle which involve the man being badly burned, Sophea's mother is killed and her body is carried out by a large brutish man."
      },
      {
        "type": "Story",
        "desc": "Belgarath reveals that the 2 men are twin brothers, Auron and Caleb Black. Auron was once an apprentice of his but was cast out for his cruelty and selfishness. The party also find a letter, amulet and some gold left for Sophea. Belgarath seems concerned and announces he must consult the Warlock Anathus."
      },
      {
        "type": "Shopping",
        "desc": "Sophea asks Morden if he can help her buy a magic weapon, as she wants to help the party. Morden takes her to Magic Emporium and meets the Flamboyant Vitto. He manages to negotiate a discount after discovering the items are second hand. Sophea is delighted."
      },
      {
        "type": "Story",
        "desc": "After investigating the whereabouts of Auron Black, Fen and Ruairih discover from Gregory he is known to frequent a more upmarket tavern in Freeport known as The Red Dragon. The party travel there and after getting info from the terrified barkeep, manage to sneak out after Auron and Caleb arrive."
      },
      {
        "type": "Story",
        "desc": "Investing the Black residence next, the group find it to be fairly abandoned, discovering the dead body of the widow mother in the bedroom closet. Skalath and Ruairih discover a secret passage and the key, and the group heads down into a basement."
      },
      {
        "type": "Encounter",
        "desc": "The group discover 4 hollow disciples sacrificing a group of high elves, and manage to defeat 3 of them before Auron and Caleb arrive back. One of the disciples uses a black stone to raise undead before escaping through a door at the back."
      },
      {
        "type": "Story",
        "desc": "Auron challenges the groups motives, and despite Fen's convincing initial argument, cannot believe 'The Master' would not relay orders to him. Auron makes a display of strength and attacks Fen with the same dark black smoke he used to kill Sophea's mother. Skalath attempts to free some of the captives but is eventually noticed, and to prove their devotion to 'The Master', Auron orders the Skalath to kill one of them. Skalath, feeling he has no choice (and much to the disgust of Ruairih and Fen) slits one of their throats."
      },
      {
        "type": "Story",
        "desc": "Satisfied for now, Auron orders the group to leave now and return tomorrow in order to carry out a task for him. As the party leave they see Auron raise the 3 dead disciples."
      }
    ]
  }
}
