{
  "arcane": {
    "desc": "you now have access to <b>Arcane</b> magic.",
    "label": "Arcane Spellcaster"
  },
  "archetype": {
    "desc": "you must choose to specialise in one of the available archetypes for your class.",
    "label": "Choose Archetype"
  },
  "areacontrol": {
    "desc": "you have the ability to masterfully control your area of effect spells. Any friendly targets within an area effect you cast no longer take the negative effects.",
    "label": "Area Control"
  },
  "assassinate": {
    "desc": "you are at your deadliest when you get the drop on your enemies. You have advantage on attack rolls against any creature that hasn't taken a turn in the combat yet. In addition, any hit you score against a creature that is <b>surprised</b> is a critical hit.",
    "label": "Assassinate"
  },
  "auraofcourage": {
    "desc": "you naturally inspire your allies with courage. Any ally within 3m of you gains +1 to <b>Attack</b> rolls. Increases to +2 at level 5, +3 at level 10, +4 at level 15 and +5 at level 20.",
    "label": "Aura of Courage"
  },
  "auraofprotection": {
    "desc": "you presence makes allies within 3m of you feel protected. They gain +1 on any <b>Saving Throws</b>. Increases to +2 at level 7, +3 at level 12 and +4 at level 17.",
    "label": "Aura of Protection"
  },
  "backstab": {
    "desc": "you are able to exploit weak spots when performing an <b>Attack Action</b> with a <b>Piercing</b> weapon from behind a non-moving enemy. If your attack hits you do an additional <b>1d6 piercing damage</b>. Damage increases to 2d6 at level 3, 3d6 at level 5, 4d6 at level 7, 5d6 at level 9, 6d6 at level 11, 7d6 at level 13, 8d6 at level 15, 9d6 at level 17, 10d6 at level 19.",
    "label": "Backstab",
    "recovery": "Round",
    "type": "Action"
  },
  "bookworm": {
    "desc": "your reading and studies have made you a knowledgeable individual, gaining +2 to any <b>Knowledge</b> checks.",
    "label": "Bookworm",
    "modifiers": [
      {
        "name": "knowledge",
        "value": 2
      }
    ]
  },
  "cunningaction": {
    "desc": "you may now spend a <b>Bonus Action</b> in order to <b>Dash</b>, <b>Disengage</b> or <b>Hide</b>.",
    "label": "Cunning Action",
    "type": "BonusAction"
  },
  "disguise": {
    "desc": "you are able to alter your appearance and voice to that of any other humanoid of a similar size. Preparation takes around an hour.",
    "label": "Disguise"
  },
  "divineintervention": {
    "desc": "when you are hit by an attack that would lower your health to 0, you may use your <b>Reaction</b> to call on your god to intervene, causing the damage to be blocked.",
    "label": "Divine Intervention",
    "recovery": "LongRest",
    "type": "Reaction"
  },
  "divineshield": {
    "desc": "you can call on the gods to protect you, granting you <b>Resistance</b> to all damage types until the start of your next turn.",
    "label": "Divine Shield",
    "recovery": "ShortRest"
  },
  "divinesmite": {
    "desc": "when making an <b>Attack</b> on an enemy that hits, you may expend a spell slot to add holy light to your weapon, doing an additional 2d8 damage plus 1d8 per level of the spell slot expended.",
    "label": "Divine Smite",
    "recovery": "ShortRest",
    "type": "Action"
  },
  "doubleattack": {
    "desc": "when making an <b>Attack Action</b>, you may attack twice.",
    "label": "Double Attack",
    "type": "Action"
  },
  "dualwielding": {
    "desc": "you may now add your damage modifier to attack rolls made with your off hand.",
    "label": "Dual Wielding"
  },
  "elusive": {
    "desc": "you can move around the battlefield with grace, gaining immunity to <b>Attacks of Opportunity</b>.",
    "label": "Elusive"
  },
  "evasion": {
    "desc": "you can nimbly dodge out of the way of certain area effects, such as a red dragon's fiery breath or a Blizzard spell. When you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you instead take no damage if you succeed on the saving throw, and only half damage if you fail.",
    "label": "Evasion"
  },
  "favouredterrain": {
    "desc": "you may choose a favoured terrain (desert, forest, hills, mountains, plains or swamps). You gain +1 to <b>Speed</b> and advantage on any <b>Stealth</b> checks while in this terrain.",
    "label": "Favoured Terrain"
  },
  "duelist": {
    "desc": "while attacking a target who is not adjacent to any characters friendly to it, you can perform <b>Backstab</b> from any side of the enemy.",
    "label": "Duelist"
  },
  "escape": {
    "desc": "when an enemy ends their movement on a space adjacent to you, you may spend your <b>Reaction</b> to move up to your speed, provoking an <b>Attack of Opportunity</b> if applicable.",
    "label": "Escape",
    "recovery": "ShortRest",
    "type": "Reaction"
  },
  "focus": {
    "desc": "you focus your studies on a particular school of magic (Abjuration, Alteration, Conjuration, Divination, Evocation or Illusion). Spells of that school gain a +1 to all rolls.",
    "label": "Focus"
  },
  "quickshot": {
    "desc": "when an enemy creature comes within range, you may make an <b>Attack of Opportunity</b> as your <b>Reaction</b>.",
    "label": "Quickshot"
  },
  "hardy": {
    "desc": "your experience in the wilderness makes you hardy. Gain <b>Advantage</b> on any CON saving throws.",
    "label": "Hardy"
  },
  "headshot": {
    "desc": "you may make an <b>Attack</b> on a target within range, if it hits, the attack counts as a <b>Critical Hit</b> regardless of the roll.",
    "label": "Headshot",
    "recovery": "ShortRest",
    "type": "Action"
  },
  "improvedcritical": {
    "desc": "you now have a keener sense of your opponents weak spots. Attack rolls of 19 and 20 count as critical.",
    "label": "Improved Critical"
  },
  "improveddivinesmite": {
    "desc": "your <b>Divine Smite</b> can now be used as many times as you wish, provided you have spells slots to expend.",
    "label": "Improved Divine Smite"
  },
  "layonhands": {
    "desc": "you can use an <b>Action</b> to place a healing hand on a friendly character within range, healing them to full health. You must take a <b>Long Rest</b> before using this skill again.",
    "label": "Lay On Hands"
  },
  "light": {
    "desc": "you have access to <b>Light</b> magic.",
    "label": "Divine Spellcaster"
  },
  "longshot": {
    "desc": "your aim has become superhuman, and gain +5m <b>Range</b> on any ranged weapons.",
    "label": "Longshot"
  },
  "magichand": {
    "desc": "you gain access to the Magic Hand cantrip and are able to use it to perform actions such as lockpicking and pickpocketing from a distance."
  },
  "magicalprotection": {
    "desc": "your arcane knowledge grants you increased protection from enemies spells. You now roll with advantage on any spell saves.",
    "label": "Magical Protection"
  },
  "meditate": {
    "desc": "as an <b>Action</b> you may immediately refresh a number of spell slots equal to your normal short rest allowance.",
    "label": "Meditate"
  },
  "mobile": {
    "desc": "you can use a <b>Bonus Action</b> in order to <b>Dash</b>.",
    "label": "Mobile",
    "type": "BonusAction"
  },
  "nature": {
    "desc": "you now have access to <b>Nature</b> magic.",
    "label": "Natural Spellcaster"
  },
  "nimblemind": {
    "desc": "you may choose to spend an available spell slot to cast a different spell of the same rank that is not currently prepared.",
    "label": "Nimble Mind",
    "recovery": "LongRest",
    "type": "Action"
  },
  "panache": {
    "desc": "you have mastered the ability to charm and deceive, gaining <b>Advantage</b> on any <b>Persuasion</b> rolls against non-magical creatures.",
    "label": "Panache"
  },
  "poisons1": {
    "desc": "you now have access to rank 1 poisons.",
    "label": "Poisons 1"
  },
  "poisons2": {
    "desc": "you now have access to rank 2 poisons.",
    "label": "Poisons 2"
  },
  "poisons3": {
    "desc": "you now have access to rank 3 poisons.",
    "label": "Poisons 3"
  },
  "poisons4": {
    "desc": "you now have access to rank 4 poisons.",
    "label": "Poisons 4"
  },
  "poisons5": {
    "desc": "you now have access to rank 5 poisons.",
    "label": "Poisons 5"
  },
  "potentpoisons": {
    "desc": "creatures now suffer <b>Disadvantage</b> when attempting to save against your poisons.",
    "label": "Potent Poisons"
  },
  "relentless": {
    "desc": "when a creature gives you an attack of opportunity, you gain your <b>Backstab</b> bonuses on that attack.",
    "label": "Relentless"
  },
  "reliabletalent": {
    "desc": "you have refined your skills until they approach perfection. Whenever you make a <b>Thievery</b>, you can treat a d20 roll of 9 or lower as a 10.",
    "label": "Reliable Talent"
  },
  "resilience": {
    "desc": "you have gained a natural toughness, granting you +1 <b>Magic Reduction</b>.",
    "label": "Resilience",
    "modifiers": [
      {
        "name": "magicreduction",
        "value": 1
      }
    ]
  },
  "shadowwalk": {
    "desc": "during your <b>Movement</b> you are able to teleport between any shadows within your line of sight. The teleport counts as 2 points of movement. Attacks of opportunity rules still apply.",
    "label": "Shadow Walk",
    "recovery": "ShortRest"
  },
  "shadowstrike": {
    "desc": "if after moving via <b>Shadow Walk</b> you are now behind an enemy, you may make spend your <b>Bonus Action</b> to perform an immediate <b>Backstab</b>.",
    "label": "Shadow Strike"
  },
  "spellmastery": {
    "desc": "you may choose a spell on rank 3 or below. That spell is now considered a <b>Cantrip</b> and can be cast without being prepared.",
    "label": "Spell Mastery"
  },
  "spellsurge": {
    "desc": "when casting a spell that does damage, you may choose to exhaust an additional slot of the same rank in order to in order to force a critical hit (maximum damage).",
    "label": "Spell Surge"
  },
  "strokeofluck": {
    "desc": "you have an uncanny knack for succeeding when you need to. If your Attack misses a target within range, you can turn the miss into a hit. Alternatively, if you fail an ability check, you can treat the d20 roll as a 20.",
    "label": "Stroke of Luck",
    "recovery": "LongRest"
  },
  "superiorcritical": {
    "desc": "you have mastered the ability to exploit your opponents weak spots. Attack rolls of 18, 19 and 20 count as critical.",
    "label": "Superior Critical"
  },
  "supernaturalawareness": {
    "desc": "your heightened senses make you ready for combat. You now attack first in combat unless you are <b>surprised</b>.",
    "label": "Supernatural Awareness"
  },
  "thievery": {
    "desc": "your misspent youth has honed your thievery skills, gaining +2 to any <b>Thievery</b> checks.",
    "label": "Criminal",
    "modifiers": [
      {
        "name": "thievery",
        "value": 2
      }
    ]
  },
  "tracker": {
    "desc": "your experience hunting has given you heightened senses, gaining +1 to <b>Perception</b> checks.",
    "label": "Tracker",
    "modifiers": [
      {
        "name": "perception",
        "value": 2
      }
    ]
  },
  "tripleattack": {
    "desc": "when making an <b>Attack Action</b>, you may attack three times.",
    "label": "Triple Attack",
    "type": "Action"
  },
  "ironwill": {
    "desc": "you now roll with advantage against being <b>Feared</b>.",
    "label": "Unbreakable Will"
  },
  "unarmedstrike": {
    "desc": "while wielding only your fists or blunt simple weapons, your attacks do 1d4+STR damage. As a <b>Bonus Action</b> you can also perform an additional unarmed strike. Your damage increases to 1d6 at level 4, 1d8 at level 8, 1d10 at level 12 and 1d12 at level 16.",
    "label": "Unarmed Strike",
    "type": "BonusAction"
  },
  "unarmoureddefense": {
    "desc": "while not wearing any armour, you add your SPI stat to your <b>Dodge</b> rating.",
    "label": "Unarmoured Defense"
  },
  "uncannydodge": {
    "desc": "when an attacker that you can see hits you with an <b>Attack</b>, you can use your reaction to halve the attack's damage against you.",
    "label": "Uncanny Dodge",
    "recovery": "ShortRest",
    "type": "Reaction"
  },
  "vanish": {
    "desc": "you can spend your <b>Bonus Action</b> to attempt to <b>Hide</b> with <b>Advantage</b>, on success you are considered invisible until your next turn.",
    "label": "Vanish",
    "recovery": "ShortRest",
    "type": "Reaction"
  },
  "animalcompanion": {
    "label": "Animal Companion",
    "desc": "you may select an animal to become a permanent companion (hawk, panther, wolf, or bear). The animal has stats roughly equal to a character of your level -1, and dependant on the type selected."
  },
  "sharedmind": {
    "label": "Shared Mind",
    "desc": "you may transfer your consciousness into your animal companion, taking full control for up to 1 hour.",
    "recovery": "ShortRest",
    "type": "Action"
  },
  "enrage": {
    "label": "Enrage",
    "desc": "you may spend your <b>Bonus Action</b> for you and your animal companion to enter a rage. Gaining 1d8+SPI temporary health and all attacks that hit do an additional 1d8 damage.",
    "recovery": "ShortRest",
    "type": "BonusAction"
  },
  "sharedbody": {
    "label": "Shared Body",
    "desc": "any beneficial effects that affect either you or your animal companion now affect both of you, including healing."
  },
  "huntersmark": {
    "label": "Hunter's Mark",
    "desc": "you may spend your <b>Bonus Action</b> marking a target you can see. You now deal an additional 1d6 damage when hitting that target and have <b>Advantage</b> on any <b>Perception</b> rolls when trying to find it.",
    "type": "BonusAction"
  },
  "volley": {
    "label": "Volley",
    "desc": "as an <b>Action</b>, you may make a ranged attack on a point within range. Roll an attack against all enemy creatures within 2m of that point.",
    "type": "Action"
  },
  "whirlwind": {
    "label": "Whirlwind",
    "desc": "as an <b>Action</b>, you may make a melee attack against any creatures within range. Roll an attack for each.",
    "type": "Action"
  },
  "defensive": {
    "label": "Defensive Stance",
    "desc": "as your <b>Bonus Action</b>, you may enter a defensive stance. All attacks made against you have <b>Disadvantage</b>, however you also have <b>Disadvantage</b> on your attacks if there is more than 1 enemy within melee range.",
    "type": "BonusAction"
  },
  "advance": {
    "label": "Advance",
    "desc": "you may now use the <b>Dash</b> action as your <b>Bonus Action</b>, however this movement must move <i>towards</i> an enemy creature.",
    "type": "BonusAction"
  },
  "eagleeye": {
    "label": "Eagle Eye",
    "desc": "you gain +2 to attack and +2 to perception",
    "modifiers": [
      {
        "name": "attack",
        "value": 2
      },
      {
        "name": "perception",
        "value": 2
      }
    ]
  },
  "imbueelement": {
    "label": "Imbue Element",
    "desc": "when casting a spell that does <b>Arcane</b> damage, you may imbue it with either fire or cold, doing an additional 1d8 damage of that type.",
    "recovery": "Round"
  },
  "arcanetorrent": {
    "label": "Arcane Torrent",
    "desc": "your <b>Arcane Missiles</b> spell now does 2d4 per missile and you have full control over which targets the missiles hit."
  },
  "multicast": {
    "label": "Multicast",
    "desc": "as your <b>Action</b>, you may cast a spell you have prepared twice. This only consumes one spell slot.",
    "recovery": "LongRest",
    "type": "Action"
  },
  "armoured": {
    "label": "Armoured",
    "desc": "you are now proficient with light, medium and heavy armour, as well as small shields."
  },
  "arcaneswordsman": {
    "label": "Arcane Swordsman",
    "desc": "while wielding a conjured weapon, you gain +3 to your <b>Attack</b> modifier and <b>Double Attack</b>."
  },
  "arcaneshield": {
    "label": "Arcane Shield",
    "desc": "as a <b>Bonus Action</b>, you may spend a spell slot to imbue your shield. Your shield gains <b>Armour</b> and <b>Magic Reduction</b> equal to the rank of the spell slot used until your next turn",
    "type": "BonusAction",
    "recovery": "LongRest"
  },
  "protect": {
    "label": "Protect",
    "desc": "when an ally within melee range is being attacked, you may spend your <b>Reaction</b> in order to impose <b>Disadvantage</b> on the attack.",
    "type": "Reaction"
  },
  "elementalfamiliar": {
    "label": "Elemental Familiar",
    "desc": "you may choose a permanent drakeling familiar (wither fire or ice). That familiar shares all stats with you, including health, and does 1d4+INT damage of the chosen type."
  },
  "prodigy": {
    "label": "Prodigy",
    "desc": "your familiar is now capable of casting <b>Cantrips</b>."
  },
  "detonate": {
    "label": "Detonate",
    "desc": "as an <b>Action</b> you may command your familiar to detonate. All creatures within 2m must make an AGI saving throw or take 2d8+INT damage of the familiars type. On save success the damage is halved. You then take 2d8 <b>Mind</b> damage and the familiar reappears beside you.",
    "type": "Action"
  },
  "arcaneelemental": {
    "label": "Arcane Elemental",
    "desc": "your conjure elemental spells now have a 3rd option: <b>Arcane</b>, which does an additional 1d8 damage."
  },
  "truthbringer": {
    "label": "Truthbringer",
    "desc": "you may attempt to compel another humanoid creature to speak the truth. The target must succeed at a SPI <b>Saving Throw</b> vs your <b>Spell DC</b> or be compelled to speak truthfully for 1 minute.",
    "type": "Action",
    "recovery": "ShortRest"
  },
  "deceiver": {
    "label": "Deceiver",
    "desc": "you gain <b>Advantage</b> on any <b>Persuasion</b> checks in which you are lying."
  },
  "bloodfury": {
    "label": "Bloodfury",
    "desc": "when an enemy within 5m of you dies, you gain 1d6 temporary health."
  },
  "vowofpeace": {
    "label": "Vow of Peace",
    "desc": "you may, as your <b>Bonus Action</b>, speak a word on an enemy within 2m. That creature now rolls with <b>Disadvantage</b> when making attacks against you for 1 minute.",
    "type": "BonusAction",
    "recovery": "ShortRest"
  },
  "vowofself": {
    "label": "Vow of Self",
    "desc": "you may, as your <b>Bonus Action</b>, speak a word on an enemy within 2m. That creature is forced to attack the nearest target that is not you on it's next turn.",
    "type": "BonusAction",
    "recovery": "ShortRest"
  },
  "vowofenmity": {
    "label": "Vow of Enmity",
    "desc": "you may, as your <b>Bonus Action</b>, speak a word on an enemy within 2m. All of your attacks on that creature now have <b>Advantage</b> for 1 minute.",
    "type": "BonusAction",
    "recovery": "ShortRest"
  },
  "improvedlayonhands": {
    "label": "Improved Lay on Hands",
    "desc": "your <b>Lay on Hands</b> now has a pool of health that can be used each day, equal to half your maximum health. Lay on Hands no longer requires a rest between uses and you can choose how much health to heal on each touch."
  },
  "shadowcaller": {
    "label": "Shadowcaller",
    "desc": "your spells that do <b>Light</b> damage now do an additional <b>1d8 Dark damage</b>."
  },
  "executioner": {
    "label": "Executioner",
    "desc": "your melee attacks now do an additional 1d8 damage when attacking <b>Wounded</b> targets."
  },
  "strengthofmind": {
    "label": "Strength of Mind",
    "desc": "Grants you +2 to <b>Intelligence</b> and <b>Charisma</b> Saving Throws.",
    "modifiers": [
      {
        "name": "saveint",
        "value": 2
      },
      {
        "name": "savecha",
        "value": 2
      }
    ]
  },
  "strengthofspirit": {
    "label": "Strength of Spirit",
    "desc": "Grants you +2 to <b>Spirit</b> and <b>Constitution</b> Saving Throws.",
    "modifiers": [
      {
        "name": "savecon",
        "value": 2
      },
      {
        "name": "savespi",
        "value": 2
      }
    ]
  },
  "strengthofbody": {
    "label": "Strength of Body",
    "desc": "Grants you +2 to <b>Strength</b> and <b>Agility</b> Saving Throws.",
    "modifiers": [
      {
        "name": "savestr",
        "value": 2
      },
      {
        "name": "saveagi",
        "value": 2
      }
    ]
  },
  "charmer": {
    "label": "Charmer",
    "desc": "You have a natural aura of friendliness about you, granting you +2 to <b>Persuasion Checks</b>.",
    "modifiers": [
      {
        "name": "persuasion",
        "value": 2
      }
    ]
  },
  "mind1": {
    "desc": "you now have access to rank 1 mind magic.",
    "label": "Mind 1"
  },
  "mind2": {
    "desc": "you now have access to rank 2 mind magic.",
    "label": "Mind 2"
  },
  "mind3": {
    "desc": "you now have access to rank 3 mind magic.",
    "label": "Mind 3"
  },
  "mind4": {
    "desc": "you now have access to rank 4 mind magic.",
    "label": "Mind 4"
  },
  "mind5": {
    "desc": "you now have access to rank 5 mind magic.",
    "label": "Mind 5"
  }
}
