{
  "arcane": {
    "desc": "you have access to <b>Arcane</b> magic spells, including <b>Cantrips</b> (rank 0).<br /><br /><b>Spellbook:</b> You have a <b>Spellbook</b> with which you can scribe and learn spells. You may select 6 spells to learn from the available spells (rank 0 and 1). Each level after 1 you may choose 2 additional spells to learn from the ranks available (see the table for when you gain access to additional ranks).<br /><br /><b>Preparing Spells</b>: During a long rest, you can select a number of spells to prepare from your spellbook equal to your <b>Intelligence</b> plus half your level (rounded down).<br/><br/><b>Casting Spells</b>: Prepared spells can then be cast by spending spell slots of the appropriate rank.<br/><br/><b>Arcane Recovery</b>: When taking a short rest, you can recover spell slots of a combined rank up to half your level (rounded down).",
    "label": "Arcane Spellcaster"
  },
  "archetype": {
    "desc": "you must choose to specialise in one of the available archetypes for your class.",
    "label": "Choose Archetype"
  },
  "areacontrol": {
    "desc": "you have the ability to masterfully control your area of effect spells. You may choose a number of targets up to the spell level + 1 within an area of effect spell you cast, those characters are unaffected by the spell.",
    "label": "Area Control"
  },
  "assassinate": {
    "desc": "you are at your deadliest when you get the drop on your enemies. You have <b>Advantage</b> on attack rolls against any creature that hasn't taken a turn in the combat yet. In addition, any hit you score against a creature that is <b>Surprised</b> is a <b>Critical</b> hit.",
    "label": "Assassinate"
  },
  "auraofcourage": {
    "desc": "you naturally inspire your allies with courage. Any ally within 3m of you gains +1 to <b>Attack</b> rolls. Increases to +2 at level 5, +3 at level 10, +4 at level 15 and +5 at level 20.",
    "label": "Aura of Courage"
  },
  "auraofprotection": {
    "desc": "you presence makes allies within 3m of you feel protected. They gain +1 on any <b>Saving Throws</b>. Increases to +2 at level 7, +3 at level 12 and +4 at level 17.",
    "label": "Aura of Protection"
  },
  "backstab": {
    "desc": "you are able to exploit weak spots when performing an <b>Attack</b> with a <b>Piercing</b> weapon from behind a non-moving enemy. If your attack hits you do an additional <b>1d6 piercing damage</b>. Damage increases to 2d6 at level 3, 3d6 at level 5, 4d6 at level 7, 5d6 at level 9, 6d6 at level 11, 7d6 at level 13, 8d6 at level 15, 9d6 at level 17, 10d6 at level 19.",
    "label": "Backstab",
    "recovery": "Round",
    "type": "Action"
  },
  "bookworm": {
    "desc": "your reading and studies have made you a knowledgeable individual, gaining +2 to any <b>Knowledge</b> checks.",
    "label": "Bookworm",
    "modifiers": [
      {
        "name": "knowledge",
        "value": 2
      }
    ]
  },
  "cunningaction": {
    "desc": "you may now spend a <b>Bonus Action</b> in order to <b>Dash</b>, <b>Disengage</b> or <b>Hide</b>.",
    "label": "Cunning Action",
    "type": "BonusAction"
  },
  "disguise": {
    "desc": "you are able to alter your appearance and voice to that of any other humanoid of a similar size. Preparation takes around an hour.",
    "label": "Disguise"
  },
  "divineintervention": {
    "desc": "when you are hit by an attack that would lower your health to 0, you may use your <b>Reaction</b> to call on your god to intervene, causing the damage to be blocked.",
    "label": "Divine Intervention",
    "recovery": "LongRest",
    "type": "Reaction"
  },
  "divineshield": {
    "desc": "you can call on the gods to protect you, granting you <b>Resistance</b> to all damage types until the start of your next turn.",
    "label": "Divine Shield",
    "recovery": "ShortRest"
  },
  "divinesmite": {
    "desc": "when making an <b>Attack</b> on an enemy that hits, you may expend a spell slot to add holy light to your weapon, doing an additional 2d8 damage plus 1d8 per level of the spell slot expended.",
    "label": "Divine Smite",
    "recovery": "ShortRest",
    "type": "Action"
  },
  "doubleattack": {
    "desc": "when making an <b>Attack Action</b>, you may attack twice.",
    "label": "Double Attack",
    "type": "Action"
  },
  "dualwielding": {
    "desc": "you may now add your damage modifier to attack rolls made with your off hand.",
    "label": "Dual Wielding"
  },
  "elusive": {
    "desc": "you can move around the battlefield with grace, gaining immunity to <b>Attacks of Opportunity</b>.",
    "label": "Elusive"
  },
  "evasion": {
    "desc": "you can nimbly dodge out of the way of certain area effects, such as a red dragon's fiery breath or a Blizzard spell. When you are subjected to an effect that allows you to make an <b>Agility Saving Throw</b> to take only half damage, you instead take no damage if you succeed on the saving throw, and only half damage if you fail.",
    "label": "Evasion"
  },
  "favouredterrain": {
    "desc": "you may choose a favoured terrain (desert, forest, hills, mountains, plains or swamps). You gain +1 to <b>Speed</b> and advantage on any <b>Stealth</b> checks while in this terrain.",
    "label": "Favoured Terrain"
  },
  "duelist": {
    "desc": "while attacking a target who is not adjacent to any characters friendly to it, you can perform <b>Backstab</b> from any side of the enemy.",
    "label": "Duelist"
  },
  "escape": {
    "desc": "when an enemy ends their movement on a space adjacent to you, you may spend your <b>Reaction</b> to move up to your speed, provoking an <b>Attack of Opportunity</b> if applicable.",
    "label": "Escape",
    "recovery": "ShortRest",
    "type": "Reaction"
  },
  "focus": {
    "desc": "you focus your studies on a particular school of magic (Abjuration, Alteration, Conjuration, Divination, Evocation or Illusion). Spells of that school gain a +1 to all rolls.",
    "label": "Focus"
  },
  "quickshot": {
    "desc": "when an enemy creature comes within range, you may make an <b>Attack of Opportunity</b> as your <b>Reaction</b>.",
    "label": "Quickshot"
  },
  "hardy": {
    "desc": "your experience in the wilderness makes you hardy. Gain <b>Advantage</b> on any CON saving throws.",
    "label": "Hardy"
  },
  "headshot": {
    "desc": "when making an <b>Attack</b>, you may choose to focus a particular point on an enemy. The attack suffers a <b>-5 to hit</b>, but gains 10m range, ignores up to 3/4 cover and if it hits deals an additional 10 damage.",
    "label": "Headshot",
    "recovery": "None",
    "type": "Action"
  },
  "improvedcritical": {
    "desc": "you now have a keener sense of your opponents weak spots. Attack rolls of 19 and 20 count as critical.",
    "label": "Improved Critical"
  },
  "improveddivinesmite": {
    "desc": "your <b>Divine Smite</b> can now be used as many times as you wish, provided you have spells slots to expend.",
    "label": "Improved Divine Smite"
  },
  "layonhands": {
    "desc": "you can use an <b>Action</b> to place a healing hand on a friendly character within range, healing them to full health, you then suffer one point of <b>Exhaustion</b>.",
    "label": "Lay On Hands",
    "recovery": "LongRest",
    "type": "Action"
  },
  "lightpaladin": {
    "desc": "you now have access to <b>Light</b> magic as per the list of <b>Paladin</b> spells.<br /><br /><b>Prepared Spells</b>: During a long rest, you can select a number of spells to prepare equal to your <b>Spirit</b> plus half your level (rounded down).<br/><br/><b>Casting Spells</b>: Prepared spells can then be cast by spending spell slots of the appropriate rank.",
    "label": "Divine Spellcaster"
  },
  "longshot": {
    "desc": "when using a ranged weapon, you are capable of shooting it at double the range without any penalty.",
    "label": "Longshot"
  },
  "magichand": {
    "label": "Mage Hand",
    "desc": "you gain access to the <b>Mage Hand</b> cantrip and are able to use it to perform actions such as lockpicking and pickpocketing from a distance."
  },
  "magicalprotection": {
    "desc": "your arcane knowledge grants you increased protection from enemies spells. You now roll with advantage on any spell saves.",
    "label": "Magical Protection"
  },
  "meditate": {
    "desc": "as an <b>Action</b> you may immediately refresh a number of spell slots equal to your normal short rest allowance.",
    "label": "Meditate"
  },
  "mobile": {
    "desc": "you can use a <b>Bonus Action</b> in order to <b>Dash</b>.",
    "label": "Mobile",
    "type": "BonusAction"
  },
  "natureranger": {
    "desc": "you now have access to <b>Nature</b> magic as per the list of <b>Ranger</b> spells.<br /><br /><b>Prepared Spells</b>: During a long rest, you can select a number of spells to prepare equal to your <b>Spirit</b> plus half your level.<br/><br/><b>Casting Spells</b>: Prepared spells can then be cast by spending spell slots of the appropriate rank.",
    "label": "Natural Spellcaster"
  },
  "nimblemind": {
    "desc": "you may choose to spend an available spell slot to cast a different spell of the same rank that is not currently prepared.",
    "label": "Nimble Mind",
    "recovery": "LongRest",
    "type": "Action"
  },
  "panache": {
    "desc": "you have mastered the ability to charm and deceive, gaining <b>Advantage</b> on any <b>Persuasion</b> rolls against non-magical creatures.",
    "label": "Panache"
  },
  "poisons1": {
    "desc": "you now have access to rank 1 poisons.",
    "label": "Poisons 1"
  },
  "poisons2": {
    "desc": "you now have access to rank 2 poisons.",
    "label": "Poisons 2"
  },
  "poisons3": {
    "desc": "you now have access to rank 3 poisons.",
    "label": "Poisons 3"
  },
  "poisons4": {
    "desc": "you now have access to rank 4 poisons.",
    "label": "Poisons 4"
  },
  "poisons5": {
    "desc": "you now have access to rank 5 poisons.",
    "label": "Poisons 5"
  },
  "potentpoisons": {
    "desc": "the strength of your poisons is increased by 2.",
    "label": "Potent Poisons",
    "modifiers": [
      {
        "name": "spelldc",
        "value": 2
      }
    ]
  },
  "reliabletalent": {
    "desc": "you have refined your skills until they approach perfection. Whenever you make a <b>Thievery</b>, you can treat a d20 roll of 9 or lower as a 10.",
    "label": "Reliable Talent"
  },
  "resilience": {
    "desc": "you have gained a natural toughness, granting you +1 <b>Spell Armour</b>.",
    "label": "Resilience",
    "modifiers": [
      {
        "name": "magicreduction",
        "value": 1
      }
    ]
  },
  "shadowwalk": {
    "desc": "during your <b>Movement</b> you are able to teleport between any shadows within your line of sight. Moving through shadows this way counts as 2 points of movement.",
    "label": "Shadow Walk",
    "recovery": "ShortRest"
  },
  "shadowstrike": {
    "desc": "if after moving via <b>Shadow Walk</b> you are now behind an enemy, you may make spend your <b>Bonus Action</b> to perform an immediate <b>Backstab</b>.",
    "label": "Shadow Strike"
  },
  "spellmastery": {
    "desc": "you may choose a spell on rank 3 or below. That spell is now considered a <b>Cantrip</b> and can be cast without being prepared.",
    "label": "Spell Mastery"
  },
  "spellsurge": {
    "desc": "when casting a spell that does damage, you may choose to exhaust an additional slot of the same rank in order to in order to force a critical hit (maximum damage).",
    "label": "Spell Surge"
  },
  "strokeofluck": {
    "desc": "you have an uncanny knack for succeeding when you need to. If your Attack misses a target within range, you can turn the miss into a hit. Alternatively, if you fail an ability check, you can treat the d20 roll as a 20.",
    "label": "Stroke of Luck",
    "recovery": "LongRest"
  },
  "superiorcritical": {
    "desc": "you have mastered the ability to exploit your opponents weak spots. Attack rolls of 18, 19 and 20 count as critical.",
    "label": "Superior Critical"
  },
  "supernaturalawareness": {
    "desc": "your heightened senses make you ready for combat. You now attack first in combat unless you are <b>surprised</b>.",
    "label": "Supernatural Awareness"
  },
  "thievery": {
    "desc": "your misspent youth has honed your thievery skills, gaining +2 to any <b>Thievery</b> checks.",
    "label": "Criminal",
    "modifiers": [
      {
        "name": "thievery",
        "value": 2
      }
    ]
  },
  "tracker": {
    "desc": "your experience hunting has given you heightened senses, gaining +1 to <b>Perception</b> checks.",
    "label": "Tracker",
    "modifiers": [
      {
        "name": "perception",
        "value": 2
      }
    ]
  },
  "tripleattack": {
    "desc": "when making an <b>Attack Action</b>, you may attack three times.",
    "label": "Triple Attack",
    "type": "Action"
  },
  "ironwill": {
    "desc": "you now roll with advantage against being <b>Feared</b>.",
    "label": "Unbreakable Will"
  },
  "unarmedstrike": {
    "desc": "while wielding only your fists or blunt simple weapons, your attacks do 1d4+STR damage. As a <b>Bonus Action</b> you can also perform an additional unarmed strike. Your damage increases to 1d6 at level 4, 1d8 at level 8, 1d10 at level 12 and 1d12 at level 16.",
    "label": "Unarmed Strike",
    "type": "BonusAction"
  },
  "unarmoureddefense": {
    "desc": "while not wearing any armour, you add your SPI stat to your <b>Dodge</b> rating.",
    "label": "Unarmoured Defense"
  },
  "uncannydodge": {
    "desc": "when an attacker that you can see hits you with an <b>Attack</b>, you can use your reaction to halve the attack's damage against you.",
    "label": "Uncanny Dodge",
    "recovery": "ShortRest",
    "type": "Reaction"
  },
  "vanish": {
    "desc": "you can spend your <b>Bonus Action</b> to attempt to <b>Hide</b> even when in plain sight. Roll a <b>Stealth</b> check with <b>Advantage</b>, all creatures that can see you must make an opposed <b>Perception</b> check. You are considered invisible to any creatures that fail the check for up to 1 minute. Making an attack removes the invisibility.",
    "label": "Vanish",
    "recovery": "ShortRest",
    "type": "Reaction"
  },
  "animalcompanion": {
    "label": "Animal Companion",
    "desc": "you may select an animal to become a permanent companion (hawk, panther, wolf, or bear). Your companion follows you and generally understands any simple orders you give it. The animal has stats roughly equal to a character 2 levels below you distributed dependant on the type selected (hawk - agile & can fly, panther - agile & stealthy, wolf - strong & agile, bear - strong & hardy)."
  },
  "sharedmind": {
    "label": "Shared Mind",
    "desc": "you may transfer your consciousness into your animal companion, taking full control for up to 1 hour.",
    "recovery": "ShortRest",
    "type": "Action"
  },
  "enrage": {
    "label": "Enrage",
    "desc": "you may spend your <b>Bonus Action</b> for you and your animal companion to enter a rage. Gaining 1d8+SPI temporary health and all attacks that hit do an additional 1d8 damage.",
    "recovery": "ShortRest",
    "type": "BonusAction"
  },
  "sharedbody": {
    "label": "Shared Body",
    "desc": "any beneficial effects that affect either you or your animal companion now affect both of you, including healing."
  },
  "huntersmark": {
    "label": "Hunter's Mark",
    "desc": "you may spend your <b>Bonus Action</b> to mark a target you can see within 20m. You now deal an additional 1d6 damage when hitting that target and have <b>Advantage</b> on any <b>Perception</b> rolls when trying to find it.",
    "type": "BonusAction"
  },
  "volley": {
    "label": "Volley",
    "desc": "as an <b>Action</b>, you may make a ranged attack on a point within range. Roll an attack against all enemy creatures within 2m of that point.",
    "type": "Action"
  },
  "whirlwind": {
    "label": "Whirlwind",
    "desc": "as an <b>Action</b>, you may make a melee attack against any creatures within range. Roll an attack for each.",
    "type": "Action"
  },
  "defensive": {
    "label": "Defensive Stance",
    "desc": "as your <b>Bonus Action</b> you may enter a defensive stance. All attacks made against you have <b>Disadvantage</b>, and all attacks you make have <b>Disadvantage</b>.<br /><br />While in this stance, when an enemy makes an attack on a friendly character within 1m of you, you may use your <b>Reaction</b> to impose <b>Disadvantage</b> on that attack as well.",
    "type": "BonusAction"
  },
  "advance": {
    "label": "Advance",
    "desc": "you may now use the <b>Dash</b> action as your <b>Bonus Action</b>, however this movement must move <i>towards</i> an enemy creature.",
    "type": "BonusAction"
  },
  "eagleeye": {
    "label": "Eagle Eye",
    "desc": "you gain +2 to attack and +2 to perception",
    "modifiers": [
      {
        "name": "attack",
        "value": 2
      },
      {
        "name": "perception",
        "value": 2
      }
    ]
  },
  "imbueelement": {
    "label": "Imbue Element",
    "desc": "when casting a spell that does <b>Arcane</b> damage, you may choose to add an addition damage die to that spell's damage. The additional die does either fire or ice damage as you choose.<br /><br />For example, when casting <b>Arcane Missiles</b>, you would spawn another missile doing another 1d4 damage of either fire or ice."
  },
  "fightingstyle": {
    "label": "Fighting Style",
    "desc": "you may select a fighting style to specialise in."
  },
  "arcanetorrent": {
    "label": "Arcane Torrent",
    "desc": "your <b>Arcane Missiles</b> spell now does 1d8 per missile and you have full control over which targets the missiles hit."
  },
  "multicast": {
    "label": "Multicast",
    "desc": "when casting a spell, you may choose to cast that spell twice, consuming an additional spell slot. The second cast must be at the same rank as the first.",
    "recovery": "LongRest",
    "type": "Action"
  },
  "armoured": {
    "label": "Armoured",
    "desc": "you are now proficient with light, medium and heavy armour, as well as small and medium shields."
  },
  "unfaltering": {
    "label": "Unfaltering",
    "desc": "when rolling a <b>Concentration</b> check to maintain a spell after taking damage, you make the roll with <b>Advantage</b>."
  },
  "arcaneshield": {
    "label": "Arcane Shield",
    "desc": "as a <b>Bonus Action</b>, you may spend a spell slot to imbue your shield. Your shield gains <b>Armour</b> and <b>Magic Reduction</b> equal to the rank of the spell slot used until your next turn",
    "type": "BonusAction",
    "recovery": "LongRest"
  },
  "protect": {
    "label": "Protect",
    "desc": "when an ally within melee range is being attacked, you may spend your <b>Reaction</b> in order to impose <b>Disadvantage</b> on the attack.",
    "type": "Reaction"
  },
  "elementalfamiliar": {
    "label": "Call Familiar",
    "desc": "you choose a permanent elemental familiar as a companion (either fire or ice) which you are able to control. The familiar takes on a physical manifestation of your choosing (drakeling, hawk, spider, weasel, bat, or cat) however this only affects it's visual appearance as its stats are shared with you, including health. On your turn, as a <b>Bonus Action</b> you can order the familiar to either move up to your speed, or make a <b>Ranged Spell Attack</b> for 1d4+INT damage of the chosen type."
  },
  "prodigy": {
    "label": "Apprentice",
    "desc": "your familiar can now, instead of moving or attacking, cast spells, though only has access to rank 0 (cantrips) wizard spells."
  },
  "detonate": {
    "label": "Adept",
    "desc": "your familiar is now capable of casting spells that you have prepared up to rank 2, and has its own spell slots equal to a level 3 wizard.",
    "type": "Action"
  },
  "arcaneelemental": {
    "label": "Prodigy",
    "desc": "your familiar is now capable of casting spells that you have prepared up to rank 4, and has its own spell slots equal to a level 7 wizard."
  },
  "truthbringer": {
    "label": "Truthbringer",
    "desc": "you may attempt to compel another humanoid creature to speak the truth. The target must succeed at a SPI <b>Saving Throw</b> vs your <b>Spell DC</b> or be compelled to speak truthfully for 1 minute.",
    "type": "Action",
    "recovery": "ShortRest"
  },
  "deceiver": {
    "label": "Deceiver",
    "desc": "you gain <b>Advantage</b> on any <b>Persuasion</b> checks in which you are lying."
  },
  "bloodfury": {
    "label": "Bloodfury",
    "desc": "when an enemy within 5m of you dies, you gain <b>1d6 temporary health</b>."
  },
  "vowofpeace": {
    "label": "Vow of Peace",
    "desc": "you may, as your <b>Bonus Action</b>, speak a word on an enemy within 2m. That creature now rolls with <b>Disadvantage</b> when making attacks against you for 1 minute.",
    "type": "BonusAction",
    "recovery": "ShortRest"
  },
  "vowofself": {
    "label": "Vow of Self",
    "desc": "you may, as your <b>Bonus Action</b>, speak a word on an enemy within 2m. That creature is forced to attack the nearest target that is not you on it's next turn.",
    "type": "BonusAction",
    "recovery": "ShortRest"
  },
  "vowofenmity": {
    "label": "Vow of Enmity",
    "desc": "you may, as your <b>Bonus Action</b>, speak a word on an enemy within 2m. All of your attacks on that creature now have <b>Advantage</b> for 1 minute.",
    "type": "BonusAction",
    "recovery": "ShortRest"
  },
  "improvedlayonhands": {
    "label": "Improved Lay on Hands",
    "desc": "your <b>Lay on Hands</b> now has a pool of health that can be used each day, equal to half your maximum health. Lay on Hands no longer requires a rest between uses and you can choose how much health to heal on each touch."
  },
  "shadowcaller": {
    "label": "Shadowcaller",
    "desc": "your spells that do <b>Light</b> damage now do an additional <b>1d8 Dark damage</b>."
  },
  "executioner": {
    "label": "Executioner",
    "desc": "your melee attacks now do an additional 1d8 damage when attacking <b>Wounded</b> targets."
  },
  "strengthofmind": {
    "label": "Strength of Mind",
    "desc": "you gain +2 to <b>Intelligence</b> and <b>Charisma</b> Saving Throws.",
    "modifiers": [
      {
        "name": "saveint",
        "value": 2
      },
      {
        "name": "savecha",
        "value": 2
      }
    ]
  },
  "strengthofspirit": {
    "label": "Strength of Spirit",
    "desc": "you gain +2 to <b>Spirit</b> and <b>Constitution</b> Saving Throws.",
    "modifiers": [
      {
        "name": "savecon",
        "value": 2
      },
      {
        "name": "savespi",
        "value": 2
      }
    ]
  },
  "strengthofbody": {
    "label": "Strength of Body",
    "desc": "you gain +2 to <b>Strength</b> and <b>Agility</b> Saving Throws.",
    "modifiers": [
      {
        "name": "savestr",
        "value": 2
      },
      {
        "name": "saveagi",
        "value": 2
      }
    ]
  },
  "charmer": {
    "label": "Charmer",
    "desc": "You have a natural aura of friendliness about you, granting you +2 to <b>Persuasion Checks</b>.",
    "modifiers": [
      {
        "name": "persuasion",
        "value": 2
      }
    ]
  },
  "mind1": {
    "desc": "you now have access to rank 1 mind magic.",
    "label": "Mind 1"
  },
  "mind2": {
    "desc": "you now have access to rank 2 mind magic.",
    "label": "Mind 2"
  },
  "mind3": {
    "desc": "you now have access to rank 3 mind magic.",
    "label": "Mind 3"
  },
  "mind4": {
    "desc": "you now have access to rank 4 mind magic.",
    "label": "Mind 4"
  },
  "mind5": {
    "desc": "you now have access to rank 5 mind magic.",
    "label": "Mind 5"
  }
}
