{
  "arcane": {
    "label": "Arcane",
    "desc": "Arcane magic is the purest form of magic, concerned with the control of raw magical energy itself as well as mastering the elements of fire and ice. Wizards are the only class that gain access to arcane magic.",
    "ranks": {
      "1": {
        "rank": 1,
        "spells": [
          {
            "label": "Shielding",
            "school": "Abjuration",
            "desc": "Choose a friendly target within 10m to receive +1 <b>spell armour</b>. Adds an additional +1 for each additional rank above 1"
          },
          {
            "label": "Blink",
            "school": "Alteration",
            "desc": "Immediately move to any spot within range of your movement <i>and</i> line of sight. Can be used while <b>Snared</b> but <i>not</i> <b>Rooted</b>. Adds 1 point of movement range for each rank above 1."
          },
          {
            "label": "Telekinesis",
            "school": "Alteration",
            "desc": "The caster can lift, with the power of their mind, a creature or object under 200KG. Enemy creatures must make an <b>Strength Saving Throw</b> or be lifted and slammed into the ground taking <b>1d4+INT Blunt damage</b> and become <b>Knocked down</b>. On save success they take half damage and are not knocked down. Does an additional 1d4 damage for each rank above 1."
          },
          {
            "label": "Summon Light",
            "school": "Conjuration",
            "desc": "Summon a magical light which follows the caster for up to 1 hour. Can be dismissed by the caster at any time."
          },
          {
            "label": "Fire Bolt",
            "school": "Evocation",
            "desc": "Make a <b>Spell Attack</b> on a target within 10m. On hit they take <b>1d8+INT Fire damage</b>. Does an additional 1d8 damage for each rank above 1."
          },
          {
            "label": "Arcane Missiles",
            "school": "Evocation",
            "desc": "Fire a number of missiles equal to your <b>Intelligence</b>, each missile hitting random nearby enemies for <b>1d4 Arcane damage</b>. Does an additional 1 damage per missile for each rank above 1."
          },
          {
            "label": "Burning Hands",
            "school": "Evocation",
            "desc": "Spray fire in a cone area in front of you with a range of 3m. All creatures within that area must make an <b>Agility Saving Throw</b> or take <b>2d6+INT Fire damage</b>. On save success they take half damage. Does an additional 1d6 damage for each rank above 1."
          }
        ]
      },
      "2": {
        "rank": 2,
        "spells": [
          {
            "label": "Open Lock",
            "school": "Alteration",
            "desc": "Choose a target that is locked. If that target is locked by mundane means, it is immediately unlocked. If the target is locked by magical means, the lock spell is suppressed for 1 minute."
          },
          {
            "label": "Swap",
            "school": "Alteration",
            "desc": "The caster swaps places with another friendly character within 10m."
          },
          {
            "label": "Eye of Zomm",
            "school": "Conjuration",
            "desc": "Summon a floating eye which the caster can 'see' through and control. Useful for scouting, however the eye is visible to others."
          },
          {
            "label": "Magic Sword",
            "school": "Conjuration",
            "desc": "Summon a sword made of pure arcane energy that only you can wield for 1 minute. It has a +1 modifier to <b>Attack</b> and does <b>2d4+INT+1 Arcane damage</b>."
          },
          {
            "label": "Summon Imp",
            "school": "Conjuration",
            "desc": "Call forth a small imp who has 3d6 + caster level health, 0 armour, 1 magic reduction, 15 dodge, 1d20+4 attack with a range of 5m and does 1d6+3 fire damage. The imp has an additional 1d6 health and 1 damage for each rank above 2."
          },
          {
            "label": "Detect Magic",
            "school": "Divination",
            "desc": "The caster becomes generally aware of any magic effects within 10m."
          },
          {
            "label": "Frost Nova",
            "school": "Evocation",
            "desc": "All creatures within 2m of you must make an <b>Constitution</b> <b>Saving Throw</b>, if they fail they take <b>3d6+INT ice damage</b> and are <b>Rooted</b>. On save success they take half damage and are not rooted."
          },
          {
            "label": "Ice Bolt",
            "school": "Evocation",
            "desc": "Make a <b>Spell Attack</b> on a target within 10m. On hit they take <b>3d8+INT Ice damage</b>. Does an additional 1d8 damage for each rank above 2."
          },
          {
            "label": "Fireball",
            "school": "Evocation",
            "desc": "Choose an area 3mx3m within 10m. All characters within the area must make an <b>Agility Saving Throw</b> or take <b>2d8+INT Fire damage</b>. On success they take half damage. Does an additional 1d8 damage for each rank above 2."
          },
          {
            "label": "Invisibility",
            "school": "Illusion",
            "desc": "Your target magically vanishes from sight for 1 hour. Only creatures with 'see invisible' will be able to see them. Performing any aggressive action will remove the invisibility. For each rank above 2, this can affect 1 additional target."
          }
        ]
      },
      "3": {
        "rank": 3,
        "spells": [
          {
            "label": "Flame Shield",
            "school": "Abjuration",
            "desc": "Engulf an ally in protective flames for 1 minute. Any characters hitting that target in melee combat take <b>3d4+INT Fire damage</b>. Does an additional 1d4 damage for each rank above 3"
          },
          {
            "label": "Cancel Magic",
            "school": "Alteration",
            "desc": "Remove a single magical effect on a target within 10m (works for both beneficial effects on enemies, and negative effects on allies). May affects an additional magical effect for each rank above 3."
          },
          {
            "label": "Dimensional Door",
            "school": "Conjuration",
            "desc": "The caster creates a dimensional hole for 1 minute at their current location and another location within 100m that they can either see or visualise. The hole allows anyone to travel through and can be dismissed by the caster at any time."
          },
          {
            "label": "Summon Elemental",
            "school": "Conjuration",
            "desc": "Summon an elemental of your choice (fire or ice), the elemental has 5d8+10 health, 6 speed, 20 dodge and does 2d8+INT damage (of the elemental type). The <b>Fire</b> elemental has a permanent rank 3 <b>Flame Shield</b>. The <b>Ice</b> version can cast a rank 3 <b>Icy Grasp</b> once with the same DC as the caster."
          },
          {
            "label": "Icy Spear",
            "school": "Conjuration",
            "desc": "Summon a spear made of pure ice that only you can wield for 1 minute. It has a range of 2, +2 modifier to <b>Attack</b> and does <b>2d4+INT+2 ice damage</b>."
          },
          {
            "label": "Summon Feast",
            "school": "Conjuration",
            "desc": "Conjure a great selection of food for up to 10 people. Anyone who consumes the food during a <b>Short or Long Rest</b> gains +2 to all saving throws and immunity to <b>Fear</b> for 12 hours."
          },
          {
            "label": "Identify",
            "school": "Divination",
            "desc": "The caster learns the magical properties of a chosen magic item they are touching."
          },
          {
            "label": "Choking Cloud",
            "school": "Evocation",
            "desc": "Create a cloud of choking gas at a target location of size 3mx3m, giving all creatures within -1 to attack and suffering <b>1d4 damage</b> when starting their turn within the cloud."
          },
          {
            "label": "Icy Grasp",
            "school": "Evocation",
            "desc": "Touch a creature within melee range, that creature must make a <b>Strength Saving Throw</b> or take <b>3d6+INT Ice damage</b> and be encased in ice, <b>Stunned</b>. On save success they take half damage and are not stunned. They must make a <b>Strength Saving Throw</b> at the start of their turn to see if they break free. Does an additional 1d6 damage for each rank above 3."
          },
          {
            "label": "Mirror Image",
            "school": "Illusion",
            "desc": "Create a number of identical copies of yourself equal to your <b>Intelligence</b>, confusing enemy creatures. Each enemy attacking you must roll 1d20, on 10 or below their attack will target a mirror image. Images die after taking any damage."
          },
          {
            "label": "Scry",
            "school": "Illusion",
            "desc": "Using a <b>Scrying Gem</b>, you can focus on a creature or location you are familiar with and be presented with a present vision of that target. If the target is a creature, it must make a <b>Spirit Saving Throw</b> to see whether it resists the scry."
          }
        ]
      },
      "4": {
        "rank": 4,
        "spells": [
          {
            "label": "Teleport",
            "school": "Alteration",
            "desc": "Instantly transports the caster to a chosen previously visited location in the world."
          },
          {
            "label": "Levitate",
            "school": "Alteration",
            "desc": "The caster levitates up to 1m off the ground and can move around freely for up to 1 hour."
          },
          {
            "label": "Flaming Sword",
            "school": "Conjuration",
            "desc": "The caster imbues a weapon within 10m with flames, adding <b>1d4+INT Fire damage</b> to that weapon for 1 minute."
          },
          {
            "label": "See Invisible",
            "school": "Conjuration",
            "desc": "Your target is able to see invisible creatures for up to 1 hour."
          },
          {
            "label": "Blizzard",
            "school": "Evocation",
            "desc": "Choose a target area of size 3m x 3m within 10m, summoning a storm. All creatures within that area must make an <b>Agility Saving Throw</b> or take <b>5d8+INT Ice damage</b>. On save success it does half damage. Does an additional 1d8 damage for each rank above 4."
          },
          {
            "label": "Chain Lightning",
            "school": "Evocation",
            "desc": "Make a <b>Spell Attack</b> on a creature within 10m. On hit the creature takes <b>3d8+INT Energy damage</b>. The lightning then bounces to up to 3 other enemy targets, making a <b>Spell Attack</b> on each and doing <b>2d8 Energy damage</b>. If one of the attacks misses then the chain ends. Each hit does an additional 1d8 damage for each rank above 4."
          },
          {
            "label": "Blur",
            "school": "Illusion",
            "desc": "Choose a target friendly character, that character becomes a blurred image for 1 minute, causing all attacking characters to roll with disadvantage when attacking that character."
          }
        ]
      },
      "5": {
        "rank": 5,
        "spells": [
          {
            "label": "Crystalize",
            "school": "Abjuration",
            "desc": "Coat yourself in hard crystal for 1 minute, gaining 4d6 temporary health. While you have this temporary health you are <b>Snared</b>."
          },
          {
            "label": "Open Portal",
            "school": "Alteration",
            "desc": "You can transport yourself up to 9 other characters you are touching to any previously visited location."
          },
          {
            "label": "Open Rift",
            "school": "Alteration",
            "desc": "You can open a rift when at a rift tear location. The rift lasts for up to 1 hour and can be dismissed at any time by you."
          },
          {
            "label": "Arcane Greatsword",
            "school": "Conjuration",
            "desc": "The caster summons a huge sword made of pure arcane energy that only they can wield for 1 minute. It has a range of 2, +5 modifier to attack and does <b>1d8+INT+5 Arcane damage</b>."
          },
          {
            "label": "Disintegrate",
            "school": "Evocation",
            "desc": "Create a beam of devastating energy originating at the caster and 10m in length. Each character in the line must make an <b>Agility Saving Throw</b> or take <b>3d8+INT Arcane damage</b> and <b>3d8+INT Fire damage</b>. On save success the damage is halved."
          },
          {
            "label": "Call Meteor",
            "school": "Evocation",
            "desc": "Calls down a burning meteor from the sky on a target area 3mx3m. Any characters within the area must make an <b>Agility Saving Throw</b> or take take <b>5d6+INT Fire damage</b> and <b>5d6+INT Blunt damage</b>. On save success the damage is halved."
          }
        ]
      }
    }
  },
  "dark": {
    "label": "Dark",
    "desc": "The powers of death and reanimation, available to necromancers and reavers."
  },
  "light": {
    "label": "Light",
    "desc": "The holy power of Marr, available to clerics and paladins.",
    "ranks": {
      "1": {
        "rank": 1,
        "spells": [
          {
            "label": "Protection",
            "school": "Abjuration",
            "desc": "Grant a friendly target +1 armour against any attacks for 1 minute. Increases by 1 armour for each rank above 1."
          },
          {
            "label": "Heal",
            "school": "Alteration",
            "desc": "Heal a target within 1m for 1d6+SPI health. Increases by 1d6 for each rank above 1."
          },
          {
            "label": "Blessing",
            "school": "Alteration",
            "desc": "The target receives +1 on all checks and attack rolls for 1 minute. Increases by +1 for each rank above 1."
          },
          {
            "label": "Cure Poison",
            "school": "Alteration",
            "desc": "Purge a single poison from the target character. May purge an additional poison for each rank above 1."
          },
          {
            "label": "Weaken Evil",
            "school": "Alteration",
            "desc": "All undead or demons within earshot must make a <b>Spirit Saving Throw</b>, on failure they are weakened, forcing their next attack roll to be made with <b>Disadvantage</b>"
          },
          {
            "label": "Holy Bolt",
            "school": "Evocation",
            "desc": "Make a <b>Spell Attack</b> vs a target within 10m, on hit deals 1d6+SPI damage. Deals an additional 1d6 damage against undead or demons. Does an additional 1d6 damage for each rank above 1. "
          }
        ]
      },
      "2": {
        "rank": 2,
        "spells": [
          {
            "label": "Symbol",
            "school": "Abjuration",
            "desc": "Mark a friendly target within 10m with a holy symbol, granting them <b>1d6+SPI temporary health</b>. Increases by 1 for each rank above 2."
          },
          {
            "label": "Focus",
            "school": "Alteration",
            "desc": "Grant a friendly target within 10m focus for 1 hour, they now roll with <b>Advantage</b> on any <b>Saving Throw</b>s."
          },
          {
            "label": "Calm",
            "school": "Alteration",
            "desc": "Calm a target, removing any <b>Fear</b> and granting you <b>Advantage</b> on any <b>Persuasion</b> checks against that character. Unwilling targets must make a <b>Charisma Saving Throw</b> to attempt to resist the affect."
          },
          {
            "label": "Cure Disease",
            "school": "Alteration",
            "desc": "Purge a single disease from the target character. May purge an additional disease for each rank above 2."
          },
          {
            "label": "Flash Heal",
            "school": "Alteration",
            "desc": "Use a <b>Bonus Action</b> to heal the target for 1d4+SPI health. Increases by 1d4 for each rank above 2."
          },
          {
            "label": "Turn Undead",
            "school": "Evocation",
            "desc": "A target undead within 10m must make a <b>Spirit Saving Throw</b>. On save failure deals <b>2d8+SPI Light damage</b> and the target is <b>Stunned</b>. On success it just deals half damage and no stun. Does an additional 1d8 damage for each rank above 2."
          },
          {
            "label": "Beam of Light",
            "school": "Evocation",
            "desc": "Make a <b>Spell Attack</b> on a target and any targets in that line, on hit deals <b>2d8+SPI Light damage</b> to each target in the line. Does an additional 1d8 damage from each rank above 2."
          }
        ]
      },
      "3": {
        "rank": 3,
        "spells": [
          {
            "label": "Resistance",
            "school": "Abjuration",
            "desc": "Pick one type of damage (physical, arcane, fire, cold, mind, light, dark or poison). That character now has <b>Resistance</b> to that type of damage for 1 minute."
          },
          {
            "label": "Revive",
            "school": "Alteration",
            "desc": "Choose a character to resurrect who has been dead for less than 1 minute. Make a <b>Spirit Saving Throw</b> vs a DC of 10 plus the target characters level. The DC increases by 1 for each time the character has been previously resurrected (including failed attempts). Other characters may assist in various forms (making additional checks to lower the DC). Casting this spell exhausts all the casters spell slots and leaves them <b>exhausted</b>."
          },
          {
            "label": "Cancel Magic",
            "school": "Alteration",
            "desc": "Remove a single magical effect on a target within 10m (works for both beneficial effects on enemies, and negative effects on allies). May affects an additional magical effect for each rank above 3."
          },
          {
            "label": "Circle of Healing",
            "school": "Alteration",
            "desc": "All friendly characters within 2m are healed for 1d8+SPI health. Increases by 1d8 for each rank above 3."
          },
          {
            "label": "Bountiful Light",
            "school": "Alteration",
            "desc": "All allies within 5m are blessed with light for 1 hour. Any heals on them now heal for the full die amount and do not need to be rolled."
          },
          {
            "label": "Scry",
            "school": "Illusion",
            "desc": "Using a <b>Scrying Gem</b>, you can focus on a creature or location you are familiar with and be presented with a present vision of that target. If the target is a creature, it must make a <b>Spirit Saving Throw</b> to see whether it resists the scry."
          }
        ]
      },
      "4": {
        "rank": 4,
        "spells": [
          {
            "label": "Holy Word",
            "school": "Evocation",
            "desc": "All enemies within earshot must make a <b>Spirit Saving Throw</b>. On a failed save they take <b>4d8+SPI Light damage</b>. Deals an additional 1d8 to undead or demons."
          },
          {
            "label": "Spirit Guardians",
            "school": "Conjuration",
            "desc": "Summon 3 protective spirits around yourself which each add 1 to your dodge. When you take damage 1 spirit is removed."
          },
          {
            "label": "Flash of Light",
            "school": "Evocation",
            "desc": "All enemies that can see you are blinded by a flash of light, they must make a <b>Constitution Saving Throw</b> or be <b>Blinded</b>."
          }
        ]
      },
      "5": {
        "rank": 5,
        "spells": [
          {
            "label": "True Resurrection",
            "school": "Alteration",
            "desc": "Choose a character to resurrect who has been dead for less than 1 year. Make a <b>Spirit Saving Throw</b> vs a DC of 10 plus the target characters level. The DC increases by 1 for each time the character has been previously resurrected (including failed attempts). Other characters may assist in various forms. Casting this spell exhausts all the casters spell slots and leaves them <b>exhausted</b>."
          },
          {
            "label": "Angel's Fury",
            "school": "Evocation",
            "desc": "Make a <b>Spell Attack</b> on a target enemy within 10m, deals 5d8+SPI light damage. Does an additional 2d8 damage to demons and undead."
          },
          {
            "label": "Vengeance",
            "school": "Alteration",
            "desc": "Grant divine protection to a target, the next fatal damage they would take is ignored and they can immediately make an attack against the attacking enemy."
          }
        ]
      }
    }
  },
  "nature": {
    "label": "Nature",
    "desc": "The power of the nature and weather.",
    "ranks": {
      "1": {
        "rank": 1,
        "spells": [
          {
            "label": "Strength of the Bear",
            "school": "Alteration",
            "desc": "Grant a friendly target additional <b>Strength</b> equal to your <b>Spirit</b> for their next check or attack."
          },
          {
            "label": "Camouflage",
            "school": "Alteration",
            "desc": "The caster blends into the wilderness, becoming invisible for 1 hour. Only works outdoors. Making any aggressive action removes it."
          },
          {
            "label": "Thorny Vines",
            "school": "Conjuration",
            "desc": "Choose an enemy within 10m, that creature must make a <b>Strength Saving Throw</b> or be wrapped with small roots causing <b>1d4+SPI Blunt damage</b> and <b>Rooting</b> them. On save success they take damage but are not rooted. On fail they must attempt the saving throw at the start of each turn to see if they break free or take further damage and remain rooted. Does an additional 1d4 damage for each rank above 1."
          },
          {
            "label": "Call Lightning",
            "school": "Evocation",
            "desc": "Make a <b>Spell Attack</b> on a target within 10m, on hit the target suffers <b>1d6+SPI Energy damage</b> and is <b>Stunned</b>. Does an additional 1d6 damage for each rank above 1."
          }
        ]
      },
      "2": {
        "rank": 2,
        "spells": [
          {
            "label": "Healing Wind",
            "school": "Alteration",
            "desc": "Heal a target within 1m for 1d6+SPI health. Increases by 1d6 for each rank above 2."
          },
          {
            "label": "Barkskin",
            "school": "Alteration",
            "desc": "Grant a friendly target within 10m +1 <b>armour</b> and +1 <b>magic reduction</b> for 1 minute. Grants an additional +1 for each rank above 2."
          },
          {
            "label": "Eyes of the Hawk",
            "school": "Alteration",
            "desc": "Grant a friendly target <b>Spirit</b> attack on their next turn."
          },
          {
            "label": "Call Animal",
            "school": "Conjuration",
            "desc": "Summon a temporary animal companion for 1 hour (Hawk, Wolf, Panther, Bear)."
          },
          {
            "label": "Call Hurricane",
            "school": "Evocation",
            "desc": "Choose a target area 3m x 3m within range. All creatures in that range must make a <b>Constitution Saving Throw</b> or take <b>2d8+SPI Blunt damage</b> and be <b>knocked down</b>. On save success they take half damage and are not knocked down. Does an additional 1d8 damage for each rank above 2."
          },
          {
            "label": "Spider Form",
            "school": "Illusion",
            "desc": "Take the form of a small spider for 1 hour. While in spider form the caster is considered basically invisible."
          }
        ]
      },
      "3": {
        "rank": 3,
        "spells": [
          {
            "label": "Speed of the Cheetah",
            "school": "Alteration",
            "desc": "Grant a friendly target Agility equal to your <b>Spirit</b> for 1 minute."
          },
          {
            "label": "Summon Wind",
            "school": "Alteration",
            "desc": "Call on the winds to help you levitate off the ground for up to 1 hour."
          },
          {
            "label": "Charm Animal",
            "school": "Illusion",
            "desc": "Choose an animal within range to make a <b>Charisma Saving Throw</b> or be <b>Charmed</b>. The creature rolls with <b>Advantage</b> if it is in combat."
          },
          {
            "label": "Bird Form",
            "school": "Illusion",
            "desc": "Take the form of a small bird for 1 hour. While in bird form the caster can fly."
          },
          {
            "label": "Scry",
            "school": "Illusion",
            "desc": "Using a <b>Scrying Gem</b>, you can focus on a creature or location you are familiar with and be presented with a present vision of that target. If the target is a creature, it must make a <b>Spirit Saving Throw</b> to see whether it resists the scry."
          }
        ]
      },
      "4": {
        "rank": 4,
        "spells": [
          {
            "label": "Treestride",
            "school": "Alteration",
            "desc": "Instantly transports the caster and up to 9 other people from one tree to another tree that the caster is aware of."
          },
          {
            "label": "Revive",
            "school": "Alteration",
            "desc": "Choose a character to resurrect who has been dead for less than 1 minute. Make a <b>Spirit Saving Throw</b> vs a DC of 10 plus the target characters level. The DC increases by 1 for each time the character has been previously resurrected (including failed attempts). Other characters may assist in various forms (making additional checks to lower the DC). Casting this spell exhausts all the casters spell slots and leaves them <b>exhausted</b>."
          },
          {
            "label": "Poison Cloud",
            "school": "Evocation",
            "desc": "Summon a cloud of poison at a target area of size 3m x 3m. All characters in the area must make a <b>Constitution</b> <b>Saving Throw</b> now and at the start of their turn or take <b>2d8+SPI Poison damage</b>."
          },
          {
            "label": "Wolf Form",
            "school": "Illusion",
            "desc": "Take the form of a large wolf for 1 hour. While in wolf form the caster gains a +3 to <b>Strength</b> and <b>Agility</b>, has <b>Haste</b>, and rolls 1d8+STR for melee attack damage."
          }
        ]
      },
      "5": {
        "rank": 5,
        "spells": [
          {
            "label": "Ankh of Reversal",
            "school": "Alteration",
            "desc": "Mark the friendly target, the next fatal damage they would take actually heals them for that amount instead."
          },
          {
            "label": "Tree Form",
            "school": "Illusion",
            "desc": "Take the form of a large tree for 1 hour. While in tree form the caster cannot move, but can still cast spells and gains <b>Resistance</b> to all damage types."
          },
          {
            "label": "Thunderstorm",
            "school": "Evocation",
            "desc": "Choose an area 3m x 3m within range to create a storm that you can maintain with <b>Concentration</b> for up to 1 minute. All creatures within that area must make an <b>Agility Saving Throw</b> or take <b>5d8+SPI Energy damage</b>. On save success they take half damage."
          }
        ]
      }
    }
  },
  "mind": {
    "label": "Mind",
    "desc": "The power to alter the mind, available to Enchanters.",
    "ranks": {
      "1": {
        "rank": 1,
        "spells": [
          {
            "label": "Enhance Mind",
            "school": "Alteration",
            "desc": "Grant your target enhanced <b>Intelligence</b> for 1 hour. That character has <b>Advantage</b> on all <b>Intelligence Checks</b> for the duration."
          },
          {
            "label": "Wrack Mind",
            "school": "Evocation",
            "desc": "Choose a creature within 10m, that creature must make an <b>Intelligence Saving Throw</b> or take <b>1d6+CHA Mind damage</b>"
          },
          {
            "label": "Mirage",
            "school": "Illusion",
            "desc": "Surround a friendly target in a mirage for 1 minute. All creatures attacking must make an <b>Intelligence Saving Throw</b> or their attack will have <b>Disadvantage</b>."
          },
          {
            "label": "Lovesick",
            "school": "Illusion",
            "desc": "Choose a creature within 10m, that creature must make a <b>Charisma Saving Throw</b> or it will be unable to attack you for 1 minute."
          },
          {
            "label": "Lesser Charm",
            "school": "Illusion",
            "desc": "Choose a creature within 10m, that creature must make a <b>Charisma Saving Throw</b> with <b>Advantage</b> or it will be <b>Charmed</b> until the end of it's next turn."
          }
        ]
      }
    }
  }
}
